GopalSaraf/Practicals/PSDL/include/proc/pic18f66k80.inc
// Register: B4D5
#define B4D5 B4D5
B4D5                                     equ 0ECBh
// bitfield definitions
B4D5_B4D5_POSN                           equ 0000h
B4D5_B4D5_POSITION                       equ 0000h
B4D5_B4D5_SIZE                           equ 0008h
B4D5_B4D5_LENGTH                         equ 0008h
B4D5_B4D5_MASK                           equ 00FFh
B4D5_B4D50_POSN                          equ 0000h
B4D5_B4D50_POSITION                      equ 0000h
B4D5_B4D50_SIZE                          equ 0001h
B4D5_B4D50_LENGTH                        equ 0001h
B4D5_B4D50_MASK                          equ 0001h
B4D5_B4D51_POSN                          equ 0001h
B4D5_B4D51_POSITION                      equ 0001h
B4D5_B4D51_SIZE                          equ 0001h
B4D5_B4D51_LENGTH                        equ 0001h
B4D5_B4D51_MASK                          equ 0002h
B4D5_B4D52_POSN                          equ 0002h
B4D5_B4D52_POSITION                      equ 0002h
B4D5_B4D52_SIZE                          equ 0001h
B4D5_B4D52_LENGTH                        equ 0001h
B4D5_B4D52_MASK                          equ 0004h
B4D5_B4D53_POSN                          equ 0003h
B4D5_B4D53_POSITION                      equ 0003h
B4D5_B4D53_SIZE                          equ 0001h
B4D5_B4D53_LENGTH                        equ 0001h
B4D5_B4D53_MASK                          equ 0008h
B4D5_B4D54_POSN                          equ 0004h
B4D5_B4D54_POSITION                      equ 0004h
B4D5_B4D54_SIZE                          equ 0001h
B4D5_B4D54_LENGTH                        equ 0001h
B4D5_B4D54_MASK                          equ 0010h
B4D5_B4D55_POSN                          equ 0005h
B4D5_B4D55_POSITION                      equ 0005h
B4D5_B4D55_SIZE                          equ 0001h
B4D5_B4D55_LENGTH                        equ 0001h
B4D5_B4D55_MASK                          equ 0020h
B4D5_B4D56_POSN                          equ 0006h
B4D5_B4D56_POSITION                      equ 0006h
B4D5_B4D56_SIZE                          equ 0001h
B4D5_B4D56_LENGTH                        equ 0001h
B4D5_B4D56_MASK                          equ 0040h
B4D5_B4D57_POSN                          equ 0007h
B4D5_B4D57_POSITION                      equ 0007h
B4D5_B4D57_SIZE                          equ 0001h
B4D5_B4D57_LENGTH                        equ 0001h
B4D5_B4D57_MASK                          equ 0080h

// Register: B4D6
#define B4D6 B4D6
B4D6                                     equ 0ECCh
// bitfield definitions
B4D6_B4D6_POSN                           equ 0000h
B4D6_B4D6_POSITION                       equ 0000h
B4D6_B4D6_SIZE                           equ 0008h
B4D6_B4D6_LENGTH                         equ 0008h
B4D6_B4D6_MASK                           equ 00FFh
B4D6_B4D60_POSN                          equ 0000h
B4D6_B4D60_POSITION                      equ 0000h
B4D6_B4D60_SIZE                          equ 0001h
B4D6_B4D60_LENGTH                        equ 0001h
B4D6_B4D60_MASK                          equ 0001h
B4D6_B4D61_POSN                          equ 0001h
B4D6_B4D61_POSITION                      equ 0001h
B4D6_B4D61_SIZE                          equ 0001h
B4D6_B4D61_LENGTH                        equ 0001h
B4D6_B4D61_MASK                          equ 0002h
B4D6_B4D62_POSN                          equ 0002h
B4D6_B4D62_POSITION                      equ 0002h
B4D6_B4D62_SIZE                          equ 0001h
B4D6_B4D62_LENGTH                        equ 0001h
B4D6_B4D62_MASK                          equ 0004h
B4D6_B4D63_POSN                          equ 0003h
B4D6_B4D63_POSITION                      equ 0003h
B4D6_B4D63_SIZE                          equ 0001h
B4D6_B4D63_LENGTH                        equ 0001h
B4D6_B4D63_MASK                          equ 0008h
B4D6_B4D64_POSN                          equ 0004h
B4D6_B4D64_POSITION                      equ 0004h
B4D6_B4D64_SIZE                          equ 0001h
B4D6_B4D64_LENGTH                        equ 0001h
B4D6_B4D64_MASK                          equ 0010h
B4D6_B4D65_POSN                          equ 0005h
B4D6_B4D65_POSITION                      equ 0005h
B4D6_B4D65_SIZE                          equ 0001h
B4D6_B4D65_LENGTH                        equ 0001h
B4D6_B4D65_MASK                          equ 0020h
B4D6_B4D66_POSN                          equ 0006h
B4D6_B4D66_POSITION                      equ 0006h
B4D6_B4D66_SIZE                          equ 0001h
B4D6_B4D66_LENGTH                        equ 0001h
B4D6_B4D66_MASK                          equ 0040h
B4D6_B4D67_POSN                          equ 0007h
B4D6_B4D67_POSITION                      equ 0007h
B4D6_B4D67_SIZE                          equ 0001h
B4D6_B4D67_LENGTH                        equ 0001h
B4D6_B4D67_MASK                          equ 0080h

// Register: B4D7
#define B4D7 B4D7
B4D7                                     equ 0ECDh
// bitfield definitions
B4D7_B4D7_POSN                           equ 0000h
B4D7_B4D7_POSITION                       equ 0000h
B4D7_B4D7_SIZE                           equ 0008h
B4D7_B4D7_LENGTH                         equ 0008h
B4D7_B4D7_MASK                           equ 00FFh
B4D7_B4D70_POSN                          equ 0000h
B4D7_B4D70_POSITION                      equ 0000h
B4D7_B4D70_SIZE                          equ 0001h
B4D7_B4D70_LENGTH                        equ 0001h
B4D7_B4D70_MASK                          equ 0001h
B4D7_B4D71_POSN                          equ 0001h
B4D7_B4D71_POSITION                      equ 0001h
B4D7_B4D71_SIZE                          equ 0001h
B4D7_B4D71_LENGTH                        equ 0001h
B4D7_B4D71_MASK                          equ 0002h
B4D7_B4D72_POSN                          equ 0002h
B4D7_B4D72_POSITION                      equ 0002h
B4D7_B4D72_SIZE                          equ 0001h
B4D7_B4D72_LENGTH                        equ 0001h
B4D7_B4D72_MASK                          equ 0004h
B4D7_B4D73_POSN                          equ 0003h
B4D7_B4D73_POSITION                      equ 0003h
B4D7_B4D73_SIZE                          equ 0001h
B4D7_B4D73_LENGTH                        equ 0001h
B4D7_B4D73_MASK                          equ 0008h
B4D7_B4D74_POSN                          equ 0004h
B4D7_B4D74_POSITION                      equ 0004h
B4D7_B4D74_SIZE                          equ 0001h
B4D7_B4D74_LENGTH                        equ 0001h
B4D7_B4D74_MASK                          equ 0010h
B4D7_B4D75_POSN                          equ 0005h
B4D7_B4D75_POSITION                      equ 0005h
B4D7_B4D75_SIZE                          equ 0001h
B4D7_B4D75_LENGTH                        equ 0001h
B4D7_B4D75_MASK                          equ 0020h
B4D7_B4D76_POSN                          equ 0006h
B4D7_B4D76_POSITION                      equ 0006h
B4D7_B4D76_SIZE                          equ 0001h
B4D7_B4D76_LENGTH                        equ 0001h
B4D7_B4D76_MASK                          equ 0040h
B4D7_B4D77_POSN                          equ 0007h
B4D7_B4D77_POSITION                      equ 0007h
B4D7_B4D77_SIZE                          equ 0001h
B4D7_B4D77_LENGTH                        equ 0001h
B4D7_B4D77_MASK                          equ 0080h

// Register: CANSTAT_RO5
#define CANSTAT_RO5 CANSTAT_RO5
CANSTAT_RO5                              equ 0ECEh
// bitfield definitions
CANSTAT_RO5_EICODE0_POSN                 equ 0000h
CANSTAT_RO5_EICODE0_POSITION             equ 0000h
CANSTAT_RO5_EICODE0_SIZE                 equ 0001h
CANSTAT_RO5_EICODE0_LENGTH               equ 0001h
CANSTAT_RO5_EICODE0_MASK                 equ 0001h
CANSTAT_RO5_EICODE1_ICODE0_POSN          equ 0001h
CANSTAT_RO5_EICODE1_ICODE0_POSITION      equ 0001h
CANSTAT_RO5_EICODE1_ICODE0_SIZE          equ 0001h
CANSTAT_RO5_EICODE1_ICODE0_LENGTH        equ 0001h
CANSTAT_RO5_EICODE1_ICODE0_MASK          equ 0002h
CANSTAT_RO5_EICODE2_ICODE1_POSN          equ 0002h
CANSTAT_RO5_EICODE2_ICODE1_POSITION      equ 0002h
CANSTAT_RO5_EICODE2_ICODE1_SIZE          equ 0001h
CANSTAT_RO5_EICODE2_ICODE1_LENGTH        equ 0001h
CANSTAT_RO5_EICODE2_ICODE1_MASK          equ 0004h
CANSTAT_RO5_EICODE3_ICODE2_POSN          equ 0003h
CANSTAT_RO5_EICODE3_ICODE2_POSITION      equ 0003h
CANSTAT_RO5_EICODE3_ICODE2_SIZE          equ 0001h
CANSTAT_RO5_EICODE3_ICODE2_LENGTH        equ 0001h
CANSTAT_RO5_EICODE3_ICODE2_MASK          equ 0008h
CANSTAT_RO5_EICODE4_POSN                 equ 0004h
CANSTAT_RO5_EICODE4_POSITION             equ 0004h
CANSTAT_RO5_EICODE4_SIZE                 equ 0001h
CANSTAT_RO5_EICODE4_LENGTH               equ 0001h
CANSTAT_RO5_EICODE4_MASK                 equ 0010h
CANSTAT_RO5_OPMODE_POSN                  equ 0005h
CANSTAT_RO5_OPMODE_POSITION              equ 0005h
CANSTAT_RO5_OPMODE_SIZE                  equ 0003h
CANSTAT_RO5_OPMODE_LENGTH                equ 0003h
CANSTAT_RO5_OPMODE_MASK                  equ 00E0h
CANSTAT_RO5_EICODE1_POSN                 equ 0001h
CANSTAT_RO5_EICODE1_POSITION             equ 0001h
CANSTAT_RO5_EICODE1_SIZE                 equ 0001h
CANSTAT_RO5_EICODE1_LENGTH               equ 0001h
CANSTAT_RO5_EICODE1_MASK                 equ 0002h
CANSTAT_RO5_EICODE2_POSN                 equ 0002h
CANSTAT_RO5_EICODE2_POSITION             equ 0002h
CANSTAT_RO5_EICODE2_SIZE                 equ 0001h
CANSTAT_RO5_EICODE2_LENGTH               equ 0001h
CANSTAT_RO5_EICODE2_MASK                 equ 0004h
CANSTAT_RO5_EICODE3_POSN                 equ 0003h
CANSTAT_RO5_EICODE3_POSITION             equ 0003h
CANSTAT_RO5_EICODE3_SIZE                 equ 0001h
CANSTAT_RO5_EICODE3_LENGTH               equ 0001h
CANSTAT_RO5_EICODE3_MASK                 equ 0008h
CANSTAT_RO5_OPMODE0_POSN                 equ 0005h
CANSTAT_RO5_OPMODE0_POSITION             equ 0005h
CANSTAT_RO5_OPMODE0_SIZE                 equ 0001h
CANSTAT_RO5_OPMODE0_LENGTH               equ 0001h
CANSTAT_RO5_OPMODE0_MASK                 equ 0020h
CANSTAT_RO5_OPMODE1_POSN                 equ 0006h
CANSTAT_RO5_OPMODE1_POSITION             equ 0006h
CANSTAT_RO5_OPMODE1_SIZE                 equ 0001h
CANSTAT_RO5_OPMODE1_LENGTH               equ 0001h
CANSTAT_RO5_OPMODE1_MASK                 equ 0040h
CANSTAT_RO5_OPMODE2_POSN                 equ 0007h
CANSTAT_RO5_OPMODE2_POSITION             equ 0007h
CANSTAT_RO5_OPMODE2_SIZE                 equ 0001h
CANSTAT_RO5_OPMODE2_LENGTH               equ 0001h
CANSTAT_RO5_OPMODE2_MASK                 equ 0080h
CANSTAT_RO5_ICODE0_POSN                  equ 0001h
CANSTAT_RO5_ICODE0_POSITION              equ 0001h
CANSTAT_RO5_ICODE0_SIZE                  equ 0001h
CANSTAT_RO5_ICODE0_LENGTH                equ 0001h
CANSTAT_RO5_ICODE0_MASK                  equ 0002h
CANSTAT_RO5_ICODE1_POSN                  equ 0002h
CANSTAT_RO5_ICODE1_POSITION              equ 0002h
CANSTAT_RO5_ICODE1_SIZE                  equ 0001h
CANSTAT_RO5_ICODE1_LENGTH                equ 0001h
CANSTAT_RO5_ICODE1_MASK                  equ 0004h
CANSTAT_RO5_ICODE2_POSN                  equ 0003h
CANSTAT_RO5_ICODE2_POSITION              equ 0003h
CANSTAT_RO5_ICODE2_SIZE                  equ 0001h
CANSTAT_RO5_ICODE2_LENGTH                equ 0001h
CANSTAT_RO5_ICODE2_MASK                  equ 0008h

// Register: CANCON_RO5
#define CANCON_RO5 CANCON_RO5
CANCON_RO5                               equ 0ECFh
// bitfield definitions
CANCON_RO5_FP0_POSN                      equ 0000h
CANCON_RO5_FP0_POSITION                  equ 0000h
CANCON_RO5_FP0_SIZE                      equ 0001h
CANCON_RO5_FP0_LENGTH                    equ 0001h
CANCON_RO5_FP0_MASK                      equ 0001h
CANCON_RO5_WIN0_FP1_POSN                 equ 0001h
CANCON_RO5_WIN0_FP1_POSITION             equ 0001h
CANCON_RO5_WIN0_FP1_SIZE                 equ 0001h
CANCON_RO5_WIN0_FP1_LENGTH               equ 0001h
CANCON_RO5_WIN0_FP1_MASK                 equ 0002h
CANCON_RO5_WIN1_FP2_POSN                 equ 0002h
CANCON_RO5_WIN1_FP2_POSITION             equ 0002h
CANCON_RO5_WIN1_FP2_SIZE                 equ 0001h
CANCON_RO5_WIN1_FP2_LENGTH               equ 0001h
CANCON_RO5_WIN1_FP2_MASK                 equ 0004h
CANCON_RO5_WIN2_FP3_POSN                 equ 0003h
CANCON_RO5_WIN2_FP3_POSITION             equ 0003h
CANCON_RO5_WIN2_FP3_SIZE                 equ 0001h
CANCON_RO5_WIN2_FP3_LENGTH               equ 0001h
CANCON_RO5_WIN2_FP3_MASK                 equ 0008h
CANCON_RO5_ABAT_POSN                     equ 0004h
CANCON_RO5_ABAT_POSITION                 equ 0004h
CANCON_RO5_ABAT_SIZE                     equ 0001h
CANCON_RO5_ABAT_LENGTH                   equ 0001h
CANCON_RO5_ABAT_MASK                     equ 0010h
CANCON_RO5_REQOP_POSN                    equ 0005h
CANCON_RO5_REQOP_POSITION                equ 0005h
CANCON_RO5_REQOP_SIZE                    equ 0003h
CANCON_RO5_REQOP_LENGTH                  equ 0003h
CANCON_RO5_REQOP_MASK                    equ 00E0h
CANCON_RO5_WIN0_POSN                     equ 0001h
CANCON_RO5_WIN0_POSITION                 equ 0001h
CANCON_RO5_WIN0_SIZE                     equ 0001h
CANCON_RO5_WIN0_LENGTH                   equ 0001h
CANCON_RO5_WIN0_MASK                     equ 0002h
CANCON_RO5_WIN1_POSN                     equ 0002h
CANCON_RO5_WIN1_POSITION                 equ 0002h
CANCON_RO5_WIN1_SIZE                     equ 0001h
CANCON_RO5_WIN1_LENGTH                   equ 0001h
CANCON_RO5_WIN1_MASK                     equ 0004h
CANCON_RO5_WIN2_POSN                     equ 0003h
CANCON_RO5_WIN2_POSITION                 equ 0003h
CANCON_RO5_WIN2_SIZE                     equ 0001h
CANCON_RO5_WIN2_LENGTH                   equ 0001h
CANCON_RO5_WIN2_MASK                     equ 0008h
CANCON_RO5_FP1_POSN                      equ 0001h
CANCON_RO5_FP1_POSITION                  equ 0001h
CANCON_RO5_FP1_SIZE                      equ 0001h
CANCON_RO5_FP1_LENGTH                    equ 0001h
CANCON_RO5_FP1_MASK                      equ 0002h
CANCON_RO5_FP2_POSN                      equ 0002h
CANCON_RO5_FP2_POSITION                  equ 0002h
CANCON_RO5_FP2_SIZE                      equ 0001h
CANCON_RO5_FP2_LENGTH                    equ 0001h
CANCON_RO5_FP2_MASK                      equ 0004h
CANCON_RO5_FP3_POSN                      equ 0003h
CANCON_RO5_FP3_POSITION                  equ 0003h
CANCON_RO5_FP3_SIZE                      equ 0001h
CANCON_RO5_FP3_LENGTH                    equ 0001h
CANCON_RO5_FP3_MASK                      equ 0008h

