GopalSaraf/Practicals/PSDL/include/proc/pic18f66k80.inc
// Register: B5CON
#define B5CON B5CON
B5CON                                    equ 0ED0h
// bitfield definitions
B5CON_FILHIT0_TXPRI0_POSN                equ 0000h
B5CON_FILHIT0_TXPRI0_POSITION            equ 0000h
B5CON_FILHIT0_TXPRI0_SIZE                equ 0001h
B5CON_FILHIT0_TXPRI0_LENGTH              equ 0001h
B5CON_FILHIT0_TXPRI0_MASK                equ 0001h
B5CON_FILHIT1_TXPRI1_POSN                equ 0001h
B5CON_FILHIT1_TXPRI1_POSITION            equ 0001h
B5CON_FILHIT1_TXPRI1_SIZE                equ 0001h
B5CON_FILHIT1_TXPRI1_LENGTH              equ 0001h
B5CON_FILHIT1_TXPRI1_MASK                equ 0002h
B5CON_FILHIT2_RTREN_POSN                 equ 0002h
B5CON_FILHIT2_RTREN_POSITION             equ 0002h
B5CON_FILHIT2_RTREN_SIZE                 equ 0001h
B5CON_FILHIT2_RTREN_LENGTH               equ 0001h
B5CON_FILHIT2_RTREN_MASK                 equ 0004h
B5CON_FILHIT3_TXREQ_POSN                 equ 0003h
B5CON_FILHIT3_TXREQ_POSITION             equ 0003h
B5CON_FILHIT3_TXREQ_SIZE                 equ 0001h
B5CON_FILHIT3_TXREQ_LENGTH               equ 0001h
B5CON_FILHIT3_TXREQ_MASK                 equ 0008h
B5CON_FILHIT4_TXERR_POSN                 equ 0004h
B5CON_FILHIT4_TXERR_POSITION             equ 0004h
B5CON_FILHIT4_TXERR_SIZE                 equ 0001h
B5CON_FILHIT4_TXERR_LENGTH               equ 0001h
B5CON_FILHIT4_TXERR_MASK                 equ 0010h
B5CON_RXRTRRO_TXLARB_POSN                equ 0005h
B5CON_RXRTRRO_TXLARB_POSITION            equ 0005h
B5CON_RXRTRRO_TXLARB_SIZE                equ 0001h
B5CON_RXRTRRO_TXLARB_LENGTH              equ 0001h
B5CON_RXRTRRO_TXLARB_MASK                equ 0020h
B5CON_RXM1_TXABT_POSN                    equ 0006h
B5CON_RXM1_TXABT_POSITION                equ 0006h
B5CON_RXM1_TXABT_SIZE                    equ 0001h
B5CON_RXM1_TXABT_LENGTH                  equ 0001h
B5CON_RXM1_TXABT_MASK                    equ 0040h
B5CON_RXFUL_TXBIF_POSN                   equ 0007h
B5CON_RXFUL_TXBIF_POSITION               equ 0007h
B5CON_RXFUL_TXBIF_SIZE                   equ 0001h
B5CON_RXFUL_TXBIF_LENGTH                 equ 0001h
B5CON_RXFUL_TXBIF_MASK                   equ 0080h
B5CON_FILHIT0_POSN                       equ 0000h
B5CON_FILHIT0_POSITION                   equ 0000h
B5CON_FILHIT0_SIZE                       equ 0001h
B5CON_FILHIT0_LENGTH                     equ 0001h
B5CON_FILHIT0_MASK                       equ 0001h
B5CON_FILHIT1_POSN                       equ 0001h
B5CON_FILHIT1_POSITION                   equ 0001h
B5CON_FILHIT1_SIZE                       equ 0001h
B5CON_FILHIT1_LENGTH                     equ 0001h
B5CON_FILHIT1_MASK                       equ 0002h
B5CON_FILHIT2_POSN                       equ 0002h
B5CON_FILHIT2_POSITION                   equ 0002h
B5CON_FILHIT2_SIZE                       equ 0001h
B5CON_FILHIT2_LENGTH                     equ 0001h
B5CON_FILHIT2_MASK                       equ 0004h
B5CON_FILHIT3_POSN                       equ 0003h
B5CON_FILHIT3_POSITION                   equ 0003h
B5CON_FILHIT3_SIZE                       equ 0001h
B5CON_FILHIT3_LENGTH                     equ 0001h
B5CON_FILHIT3_MASK                       equ 0008h
B5CON_FILHIT4_POSN                       equ 0004h
B5CON_FILHIT4_POSITION                   equ 0004h
B5CON_FILHIT4_SIZE                       equ 0001h
B5CON_FILHIT4_LENGTH                     equ 0001h
B5CON_FILHIT4_MASK                       equ 0010h
B5CON_RXRTRRO_POSN                       equ 0005h
B5CON_RXRTRRO_POSITION                   equ 0005h
B5CON_RXRTRRO_SIZE                       equ 0001h
B5CON_RXRTRRO_LENGTH                     equ 0001h
B5CON_RXRTRRO_MASK                       equ 0020h
B5CON_RXM1_POSN                          equ 0006h
B5CON_RXM1_POSITION                      equ 0006h
B5CON_RXM1_SIZE                          equ 0001h
B5CON_RXM1_LENGTH                        equ 0001h
B5CON_RXM1_MASK                          equ 0040h
B5CON_RXFUL_POSN                         equ 0007h
B5CON_RXFUL_POSITION                     equ 0007h
B5CON_RXFUL_SIZE                         equ 0001h
B5CON_RXFUL_LENGTH                       equ 0001h
B5CON_RXFUL_MASK                         equ 0080h
B5CON_TXPRI0_POSN                        equ 0000h
B5CON_TXPRI0_POSITION                    equ 0000h
B5CON_TXPRI0_SIZE                        equ 0001h
B5CON_TXPRI0_LENGTH                      equ 0001h
B5CON_TXPRI0_MASK                        equ 0001h
B5CON_TXPRI1_POSN                        equ 0001h
B5CON_TXPRI1_POSITION                    equ 0001h
B5CON_TXPRI1_SIZE                        equ 0001h
B5CON_TXPRI1_LENGTH                      equ 0001h
B5CON_TXPRI1_MASK                        equ 0002h
B5CON_RTREN_POSN                         equ 0002h
B5CON_RTREN_POSITION                     equ 0002h
B5CON_RTREN_SIZE                         equ 0001h
B5CON_RTREN_LENGTH                       equ 0001h
B5CON_RTREN_MASK                         equ 0004h
B5CON_TXREQ_POSN                         equ 0003h
B5CON_TXREQ_POSITION                     equ 0003h
B5CON_TXREQ_SIZE                         equ 0001h
B5CON_TXREQ_LENGTH                       equ 0001h
B5CON_TXREQ_MASK                         equ 0008h
B5CON_TXERR_POSN                         equ 0004h
B5CON_TXERR_POSITION                     equ 0004h
B5CON_TXERR_SIZE                         equ 0001h
B5CON_TXERR_LENGTH                       equ 0001h
B5CON_TXERR_MASK                         equ 0010h
B5CON_TXLARB_POSN                        equ 0005h
B5CON_TXLARB_POSITION                    equ 0005h
B5CON_TXLARB_SIZE                        equ 0001h
B5CON_TXLARB_LENGTH                      equ 0001h
B5CON_TXLARB_MASK                        equ 0020h
B5CON_TXABT_POSN                         equ 0006h
B5CON_TXABT_POSITION                     equ 0006h
B5CON_TXABT_SIZE                         equ 0001h
B5CON_TXABT_LENGTH                       equ 0001h
B5CON_TXABT_MASK                         equ 0040h
B5CON_TXBIF_POSN                         equ 0007h
B5CON_TXBIF_POSITION                     equ 0007h
B5CON_TXBIF_SIZE                         equ 0001h
B5CON_TXBIF_LENGTH                       equ 0001h
B5CON_TXBIF_MASK                         equ 0080h
B5CON_B5FILHIT0_POSN                     equ 0000h
B5CON_B5FILHIT0_POSITION                 equ 0000h
B5CON_B5FILHIT0_SIZE                     equ 0001h
B5CON_B5FILHIT0_LENGTH                   equ 0001h
B5CON_B5FILHIT0_MASK                     equ 0001h
B5CON_B5FILHIT1_POSN                     equ 0001h
B5CON_B5FILHIT1_POSITION                 equ 0001h
B5CON_B5FILHIT1_SIZE                     equ 0001h
B5CON_B5FILHIT1_LENGTH                   equ 0001h
B5CON_B5FILHIT1_MASK                     equ 0002h
B5CON_B5FILHIT2_POSN                     equ 0002h
B5CON_B5FILHIT2_POSITION                 equ 0002h
B5CON_B5FILHIT2_SIZE                     equ 0001h
B5CON_B5FILHIT2_LENGTH                   equ 0001h
B5CON_B5FILHIT2_MASK                     equ 0004h
B5CON_B5FILHIT3_POSN                     equ 0003h
B5CON_B5FILHIT3_POSITION                 equ 0003h
B5CON_B5FILHIT3_SIZE                     equ 0001h
B5CON_B5FILHIT3_LENGTH                   equ 0001h
B5CON_B5FILHIT3_MASK                     equ 0008h
B5CON_B5FILHIT4_POSN                     equ 0004h
B5CON_B5FILHIT4_POSITION                 equ 0004h
B5CON_B5FILHIT4_SIZE                     equ 0001h
B5CON_B5FILHIT4_LENGTH                   equ 0001h
B5CON_B5FILHIT4_MASK                     equ 0010h
B5CON_B5RTRRO_POSN                       equ 0005h
B5CON_B5RTRRO_POSITION                   equ 0005h
B5CON_B5RTRRO_SIZE                       equ 0001h
B5CON_B5RTRRO_LENGTH                     equ 0001h
B5CON_B5RTRRO_MASK                       equ 0020h
B5CON_B5RXM1_POSN                        equ 0006h
B5CON_B5RXM1_POSITION                    equ 0006h
B5CON_B5RXM1_SIZE                        equ 0001h
B5CON_B5RXM1_LENGTH                      equ 0001h
B5CON_B5RXM1_MASK                        equ 0040h
B5CON_B5RXFUL_POSN                       equ 0007h
B5CON_B5RXFUL_POSITION                   equ 0007h
B5CON_B5RXFUL_SIZE                       equ 0001h
B5CON_B5RXFUL_LENGTH                     equ 0001h
B5CON_B5RXFUL_MASK                       equ 0080h
B5CON_B5TXPRI0_POSN                      equ 0000h
B5CON_B5TXPRI0_POSITION                  equ 0000h
B5CON_B5TXPRI0_SIZE                      equ 0001h
B5CON_B5TXPRI0_LENGTH                    equ 0001h
B5CON_B5TXPRI0_MASK                      equ 0001h
B5CON_B5TXPRI1_POSN                      equ 0001h
B5CON_B5TXPRI1_POSITION                  equ 0001h
B5CON_B5TXPRI1_SIZE                      equ 0001h
B5CON_B5TXPRI1_LENGTH                    equ 0001h
B5CON_B5TXPRI1_MASK                      equ 0002h
B5CON_B5RTREN_POSN                       equ 0002h
B5CON_B5RTREN_POSITION                   equ 0002h
B5CON_B5RTREN_SIZE                       equ 0001h
B5CON_B5RTREN_LENGTH                     equ 0001h
B5CON_B5RTREN_MASK                       equ 0004h
B5CON_B5TXREQ_POSN                       equ 0003h
B5CON_B5TXREQ_POSITION                   equ 0003h
B5CON_B5TXREQ_SIZE                       equ 0001h
B5CON_B5TXREQ_LENGTH                     equ 0001h
B5CON_B5TXREQ_MASK                       equ 0008h
B5CON_B5TXERR_POSN                       equ 0004h
B5CON_B5TXERR_POSITION                   equ 0004h
B5CON_B5TXERR_SIZE                       equ 0001h
B5CON_B5TXERR_LENGTH                     equ 0001h
B5CON_B5TXERR_MASK                       equ 0010h
B5CON_B5TXLARB_POSN                      equ 0005h
B5CON_B5TXLARB_POSITION                  equ 0005h
B5CON_B5TXLARB_SIZE                      equ 0001h
B5CON_B5TXLARB_LENGTH                    equ 0001h
B5CON_B5TXLARB_MASK                      equ 0020h
B5CON_B5TXABT_POSN                       equ 0006h
B5CON_B5TXABT_POSITION                   equ 0006h
B5CON_B5TXABT_SIZE                       equ 0001h
B5CON_B5TXABT_LENGTH                     equ 0001h
B5CON_B5TXABT_MASK                       equ 0040h
B5CON_B5TXBIF_POSN                       equ 0007h
B5CON_B5TXBIF_POSITION                   equ 0007h
B5CON_B5TXBIF_SIZE                       equ 0001h
B5CON_B5TXBIF_LENGTH                     equ 0001h
B5CON_B5TXBIF_MASK                       equ 0080h

// Register: B5SIDH
#define B5SIDH B5SIDH
B5SIDH                                   equ 0ED1h
// bitfield definitions
B5SIDH_SID_POSN                          equ 0000h
B5SIDH_SID_POSITION                      equ 0000h
B5SIDH_SID_SIZE                          equ 0008h
B5SIDH_SID_LENGTH                        equ 0008h
B5SIDH_SID_MASK                          equ 00FFh
B5SIDH_SID3_POSN                         equ 0000h
B5SIDH_SID3_POSITION                     equ 0000h
B5SIDH_SID3_SIZE                         equ 0001h
B5SIDH_SID3_LENGTH                       equ 0001h
B5SIDH_SID3_MASK                         equ 0001h
B5SIDH_SID4_POSN                         equ 0001h
B5SIDH_SID4_POSITION                     equ 0001h
B5SIDH_SID4_SIZE                         equ 0001h
B5SIDH_SID4_LENGTH                       equ 0001h
B5SIDH_SID4_MASK                         equ 0002h
B5SIDH_SID5_POSN                         equ 0002h
B5SIDH_SID5_POSITION                     equ 0002h
B5SIDH_SID5_SIZE                         equ 0001h
B5SIDH_SID5_LENGTH                       equ 0001h
B5SIDH_SID5_MASK                         equ 0004h
B5SIDH_SID6_POSN                         equ 0003h
B5SIDH_SID6_POSITION                     equ 0003h
B5SIDH_SID6_SIZE                         equ 0001h
B5SIDH_SID6_LENGTH                       equ 0001h
B5SIDH_SID6_MASK                         equ 0008h
B5SIDH_SID7_POSN                         equ 0004h
B5SIDH_SID7_POSITION                     equ 0004h
B5SIDH_SID7_SIZE                         equ 0001h
B5SIDH_SID7_LENGTH                       equ 0001h
B5SIDH_SID7_MASK                         equ 0010h
B5SIDH_SID8_POSN                         equ 0005h
B5SIDH_SID8_POSITION                     equ 0005h
B5SIDH_SID8_SIZE                         equ 0001h
B5SIDH_SID8_LENGTH                       equ 0001h
B5SIDH_SID8_MASK                         equ 0020h
B5SIDH_SID9_POSN                         equ 0006h
B5SIDH_SID9_POSITION                     equ 0006h
B5SIDH_SID9_SIZE                         equ 0001h
B5SIDH_SID9_LENGTH                       equ 0001h
B5SIDH_SID9_MASK                         equ 0040h
B5SIDH_SID10_POSN                        equ 0007h
B5SIDH_SID10_POSITION                    equ 0007h
B5SIDH_SID10_SIZE                        equ 0001h
B5SIDH_SID10_LENGTH                      equ 0001h
B5SIDH_SID10_MASK                        equ 0080h
B5SIDH_B5SID3_POSN                       equ 0000h
B5SIDH_B5SID3_POSITION                   equ 0000h
B5SIDH_B5SID3_SIZE                       equ 0001h
B5SIDH_B5SID3_LENGTH                     equ 0001h
B5SIDH_B5SID3_MASK                       equ 0001h
B5SIDH_B5SID4_POSN                       equ 0001h
B5SIDH_B5SID4_POSITION                   equ 0001h
B5SIDH_B5SID4_SIZE                       equ 0001h
B5SIDH_B5SID4_LENGTH                     equ 0001h
B5SIDH_B5SID4_MASK                       equ 0002h
B5SIDH_B5SID5_POSN                       equ 0002h
B5SIDH_B5SID5_POSITION                   equ 0002h
B5SIDH_B5SID5_SIZE                       equ 0001h
B5SIDH_B5SID5_LENGTH                     equ 0001h
B5SIDH_B5SID5_MASK                       equ 0004h
B5SIDH_B5SID6_POSN                       equ 0003h
B5SIDH_B5SID6_POSITION                   equ 0003h
B5SIDH_B5SID6_SIZE                       equ 0001h
B5SIDH_B5SID6_LENGTH                     equ 0001h
B5SIDH_B5SID6_MASK                       equ 0008h
B5SIDH_B5SID7_POSN                       equ 0004h
B5SIDH_B5SID7_POSITION                   equ 0004h
B5SIDH_B5SID7_SIZE                       equ 0001h
B5SIDH_B5SID7_LENGTH                     equ 0001h
B5SIDH_B5SID7_MASK                       equ 0010h
B5SIDH_B5SID8_POSN                       equ 0005h
B5SIDH_B5SID8_POSITION                   equ 0005h
B5SIDH_B5SID8_SIZE                       equ 0001h
B5SIDH_B5SID8_LENGTH                     equ 0001h
B5SIDH_B5SID8_MASK                       equ 0020h
B5SIDH_B5SID9_POSN                       equ 0006h
B5SIDH_B5SID9_POSITION                   equ 0006h
B5SIDH_B5SID9_SIZE                       equ 0001h
B5SIDH_B5SID9_LENGTH                     equ 0001h
B5SIDH_B5SID9_MASK                       equ 0040h
B5SIDH_B5SID10_POSN                      equ 0007h
B5SIDH_B5SID10_POSITION                  equ 0007h
B5SIDH_B5SID10_SIZE                      equ 0001h
B5SIDH_B5SID10_LENGTH                    equ 0001h
B5SIDH_B5SID10_MASK                      equ 0080h

