GopalSaraf/Practicals/PSDL/include/proc/pic18f66k80.inc
#define RC2                              BANKMASK(PORTC), 2, a
#define RC2IE                            BANKMASK(PIE3), 5, a
#define RC2IF                            BANKMASK(PIR3), 5, a
#define RC2IP                            BANKMASK(IPR3), 5, a
#define RC3                              BANKMASK(PORTC), 3, a
#define RC4                              BANKMASK(PORTC), 4, a
#define RC5                              BANKMASK(PORTC), 5, a
#define RC6                              BANKMASK(PORTC), 6, a
#define RC7                              BANKMASK(PORTC), 7, a
#define RC8_9                            BANKMASK(RCSTA1), 6, a
#define RC8_92                           BANKMASK(RCSTA2), 6, a
#define RC9                              BANKMASK(RCSTA1), 6, a
#define RC92                             BANKMASK(RCSTA2), 6, a
#define RCD8                             BANKMASK(RCSTA1), 0, a
#define RCD82                            BANKMASK(RCSTA2), 0, a
#define RCEN                             BANKMASK(SSPCON2), 3, a
#define RCIDL1                           BANKMASK(BAUDCON1), 6, a
#define RCIDL2                           BANKMASK(BAUDCON2), 6, a
#define RCIE                             BANKMASK(PIE1), 5, a
#define RCIF                             BANKMASK(PIR1), 5, a
#define RCIP                             BANKMASK(IPR1), 5, a
#define RCMT1                            BANKMASK(BAUDCON1), 6, a
#define RCMT2                            BANKMASK(BAUDCON2), 6, a
#define RD                               BANKMASK(EECON1), 0, a
#define RD0                              BANKMASK(PORTD), 0, a
#define RD1                              BANKMASK(PORTD), 1, a
#define RD163                            BANKMASK(T3CON), 7, a
#define RD2                              BANKMASK(PORTD), 2, a
#define RD3                              BANKMASK(PORTD), 3, a
#define RD4                              BANKMASK(PORTD), 4, a
#define RD5                              BANKMASK(PORTD), 5, a
#define RD6                              BANKMASK(PORTD), 6, a
#define RD7                              BANKMASK(PORTD), 7, a
#define RDE                              BANKMASK(PORTE), 0, a
#define RDPU                             BANKMASK(PADCFG1), 7, b
#define RE0                              BANKMASK(PORTE), 0, a
#define RE1                              BANKMASK(PORTE), 1, a
#define RE2                              BANKMASK(PORTE), 2, a
#define RE3                              BANKMASK(PORTE), 3, a
#define RE4                              BANKMASK(PORTE), 4, a
#define RE5                              BANKMASK(PORTE), 5, a
#define RE6                              BANKMASK(PORTE), 6, a
#define RE7                              BANKMASK(PORTE), 7, a
#define READ_WRITE                       BANKMASK(SSPSTAT), 2, a
#define REC0                             BANKMASK(RXERRCNT), 0, b
#define REC1                             BANKMASK(RXERRCNT), 1, b
#define REC2                             BANKMASK(RXERRCNT), 2, b
#define REC3                             BANKMASK(RXERRCNT), 3, b
#define REC4                             BANKMASK(RXERRCNT), 4, b
#define REC5                             BANKMASK(RXERRCNT), 5, b
#define REC6                             BANKMASK(RXERRCNT), 6, b
#define REC7                             BANKMASK(RXERRCNT), 7, b
#define REGSLP                           BANKMASK(WDTCON), 7, a
#define REPU                             BANKMASK(PADCFG1), 6, b
#define RF0                              BANKMASK(PORTF), 0, a
#define RF1                              BANKMASK(PORTF), 1, a
#define RF2                              BANKMASK(PORTF), 2, a
#define RF3                              BANKMASK(PORTF), 3, a
#define RF4                              BANKMASK(PORTF), 4, a
#define RF5                              BANKMASK(PORTF), 5, a
#define RF6                              BANKMASK(PORTF), 6, a
#define RF7                              BANKMASK(PORTF), 7, a
#define RFPU                             BANKMASK(PADCFG1), 5, b
#define RG0                              BANKMASK(PORTG), 0, a
#define RG1                              BANKMASK(PORTG), 1, a
#define RG2                              BANKMASK(PORTG), 2, a
#define RG3                              BANKMASK(PORTG), 3, a
#define RG4                              BANKMASK(PORTG), 4, a
#define RGPU                             BANKMASK(PADCFG1), 4, b
#define RI                               BANKMASK(RCON), 4, a
#define RJPU                             BANKMASK(PORTA), 7, a
#define RODIV0                           BANKMASK(REFOCON), 0, a
#define RODIV1                           BANKMASK(REFOCON), 1, a
#define RODIV2                           BANKMASK(REFOCON), 2, a
#define RODIV3                           BANKMASK(REFOCON), 3, a
#define ROON                             BANKMASK(REFOCON), 7, a
#define ROSEL                            BANKMASK(REFOCON), 4, a
#define ROSSLP                           BANKMASK(REFOCON), 5, a
#define RSEN                             BANKMASK(SSPCON2), 1, a
#define RW                               BANKMASK(SSPSTAT), 2, a
#define RX91                             BANKMASK(RCSTA1), 6, a
#define RX92                             BANKMASK(RCSTA2), 6, a
#define RX9D1                            BANKMASK(RCSTA1), 0, a
#define RX9D2                            BANKMASK(RCSTA2), 0, a
#define RXB0D00                          BANKMASK(RXB0D0), 0, a
#define RXB0D01                          BANKMASK(RXB0D0), 1, a
#define RXB0D02                          BANKMASK(RXB0D0), 2, a
#define RXB0D03                          BANKMASK(RXB0D0), 3, a
#define RXB0D04                          BANKMASK(RXB0D0), 4, a
#define RXB0D05                          BANKMASK(RXB0D0), 5, a
#define RXB0D06                          BANKMASK(RXB0D0), 6, a
#define RXB0D07                          BANKMASK(RXB0D0), 7, a
#define RXB0D10                          BANKMASK(RXB0D1), 0, a
#define RXB0D11                          BANKMASK(RXB0D1), 1, a
#define RXB0D12                          BANKMASK(RXB0D1), 2, a
#define RXB0D13                          BANKMASK(RXB0D1), 3, a
#define RXB0D14                          BANKMASK(RXB0D1), 4, a
#define RXB0D15                          BANKMASK(RXB0D1), 5, a
#define RXB0D16                          BANKMASK(RXB0D1), 6, a
#define RXB0D17                          BANKMASK(RXB0D1), 7, a
#define RXB0D20                          BANKMASK(RXB0D2), 0, a
#define RXB0D21                          BANKMASK(RXB0D2), 1, a
#define RXB0D22                          BANKMASK(RXB0D2), 2, a
#define RXB0D23                          BANKMASK(RXB0D2), 3, a
#define RXB0D24                          BANKMASK(RXB0D2), 4, a
#define RXB0D25                          BANKMASK(RXB0D2), 5, a
#define RXB0D26                          BANKMASK(RXB0D2), 6, a
#define RXB0D27                          BANKMASK(RXB0D2), 7, a
#define RXB0D30                          BANKMASK(RXB0D3), 0, a
#define RXB0D31                          BANKMASK(RXB0D3), 1, a
#define RXB0D32                          BANKMASK(RXB0D3), 2, a
#define RXB0D33                          BANKMASK(RXB0D3), 3, a
#define RXB0D34                          BANKMASK(RXB0D3), 4, a
#define RXB0D35                          BANKMASK(RXB0D3), 5, a
#define RXB0D36                          BANKMASK(RXB0D3), 6, a
#define RXB0D37                          BANKMASK(RXB0D3), 7, a
#define RXB0D40                          BANKMASK(RXB0D4), 0, a
#define RXB0D41                          BANKMASK(RXB0D4), 1, a
#define RXB0D42                          BANKMASK(RXB0D4), 2, a
#define RXB0D43                          BANKMASK(RXB0D4), 3, a
#define RXB0D44                          BANKMASK(RXB0D4), 4, a
#define RXB0D45                          BANKMASK(RXB0D4), 5, a
#define RXB0D46                          BANKMASK(RXB0D4), 6, a
#define RXB0D47                          BANKMASK(RXB0D4), 7, a
#define RXB0D50                          BANKMASK(RXB0D5), 0, a
#define RXB0D51                          BANKMASK(RXB0D5), 1, a
#define RXB0D52                          BANKMASK(RXB0D5), 2, a
#define RXB0D53                          BANKMASK(RXB0D5), 3, a
#define RXB0D54                          BANKMASK(RXB0D5), 4, a
#define RXB0D55                          BANKMASK(RXB0D5), 5, a
#define RXB0D56                          BANKMASK(RXB0D5), 6, a
#define RXB0D57                          BANKMASK(RXB0D5), 7, a
#define RXB0D60                          BANKMASK(RXB0D6), 0, a
#define RXB0D61                          BANKMASK(RXB0D6), 1, a
#define RXB0D62                          BANKMASK(RXB0D6), 2, a
#define RXB0D63                          BANKMASK(RXB0D6), 3, a
#define RXB0D64                          BANKMASK(RXB0D6), 4, a
#define RXB0D65                          BANKMASK(RXB0D6), 5, a
#define RXB0D66                          BANKMASK(RXB0D6), 6, a
#define RXB0D67                          BANKMASK(RXB0D6), 7, a
#define RXB0D70                          BANKMASK(RXB0D7), 0, a
#define RXB0D71                          BANKMASK(RXB0D7), 1, a
#define RXB0D72                          BANKMASK(RXB0D7), 2, a
#define RXB0D73                          BANKMASK(RXB0D7), 3, a
#define RXB0D74                          BANKMASK(RXB0D7), 4, a
#define RXB0D75                          BANKMASK(RXB0D7), 5, a
#define RXB0D76                          BANKMASK(RXB0D7), 6, a
#define RXB0D77                          BANKMASK(RXB0D7), 7, a
#define RXB0DLC0                         BANKMASK(RXB0DLC), 0, a
#define RXB0DLC1                         BANKMASK(RXB0DLC), 1, a
#define RXB0DLC2                         BANKMASK(RXB0DLC), 2, a
#define RXB0DLC3                         BANKMASK(RXB0DLC), 3, a
#define RXB0EID0                         BANKMASK(RXB0EIDL), 0, a
#define RXB0EID1                         BANKMASK(RXB0EIDL), 1, a
#define RXB0EID10                        BANKMASK(RXB0EIDH), 2, a
#define RXB0EID11                        BANKMASK(RXB0EIDH), 3, a
#define RXB0EID12                        BANKMASK(RXB0EIDH), 4, a
#define RXB0EID13                        BANKMASK(RXB0EIDH), 5, a
#define RXB0EID14                        BANKMASK(RXB0EIDH), 6, a
#define RXB0EID15                        BANKMASK(RXB0EIDH), 7, a
#define RXB0EID16                        BANKMASK(RXB0SIDL), 0, a
#define RXB0EID17                        BANKMASK(RXB0SIDL), 1, a
#define RXB0EID2                         BANKMASK(RXB0EIDL), 2, a
#define RXB0EID3                         BANKMASK(RXB0EIDL), 3, a
#define RXB0EID4                         BANKMASK(RXB0EIDL), 4, a
#define RXB0EID5                         BANKMASK(RXB0EIDL), 5, a
#define RXB0EID6                         BANKMASK(RXB0EIDL), 6, a
#define RXB0EID7                         BANKMASK(RXB0EIDL), 7, a
#define RXB0EID8                         BANKMASK(RXB0EIDH), 0, a
#define RXB0EID9                         BANKMASK(RXB0EIDH), 1, a
#define RXB0EXID                         BANKMASK(RXB0SIDL), 3, a
#define RXB0FILHIT0                      BANKMASK(RXB0CON), 0, a
#define RXB0FILHIT1                      BANKMASK(RXB0CON), 1, a
#define RXB0FILHIT2                      BANKMASK(RXB0CON), 2, a
#define RXB0FILHIT3                      BANKMASK(RXB0CON), 3, a
#define RXB0FILHIT4                      BANKMASK(RXB0CON), 4, a
#define RXB0FUL                          BANKMASK(RXB0CON), 7, a
#define RXB0IF                           BANKMASK(PIR5), 0, a
#define RXB0IP                           BANKMASK(IPR5), 0, a
#define RXB0M0                           BANKMASK(RXB0CON), 5, a
#define RXB0M1                           BANKMASK(RXB0CON), 6, a
#define RXB0OVFL                         BANKMASK(COMSTAT), 7, a
#define RXB0RB0                          BANKMASK(RXB0DLC), 4, a
#define RXB0RB1                          BANKMASK(RXB0DLC), 5, a
#define RXB0RTR                          BANKMASK(RXB0DLC), 6, a
#define RXB0RTRR0                        BANKMASK(RXB0CON), 3, a
#define RXB0RTRRO                        BANKMASK(RXB0CON), 5, a
#define RXB0SID0                         BANKMASK(RXB0SIDL), 5, a
#define RXB0SID1                         BANKMASK(RXB0SIDL), 6, a
#define RXB0SID10                        BANKMASK(RXB0SIDH), 7, a
#define RXB0SID2                         BANKMASK(RXB0SIDL), 7, a
#define RXB0SID3                         BANKMASK(RXB0SIDH), 0, a
#define RXB0SID4                         BANKMASK(RXB0SIDH), 1, a
#define RXB0SID5                         BANKMASK(RXB0SIDH), 2, a
#define RXB0SID6                         BANKMASK(RXB0SIDH), 3, a
#define RXB0SID7                         BANKMASK(RXB0SIDH), 4, a
#define RXB0SID8                         BANKMASK(RXB0SIDH), 5, a
#define RXB0SID9                         BANKMASK(RXB0SIDH), 6, a
#define RXB0SRR                          BANKMASK(RXB0SIDL), 4, a
#define RXB1D00                          BANKMASK(RXB1D0), 0, b
#define RXB1D01                          BANKMASK(RXB1D0), 1, b
#define RXB1D02                          BANKMASK(RXB1D0), 2, b
#define RXB1D03                          BANKMASK(RXB1D0), 3, b
#define RXB1D04                          BANKMASK(RXB1D0), 4, b
#define RXB1D05                          BANKMASK(RXB1D0), 5, b
#define RXB1D06                          BANKMASK(RXB1D0), 6, b
#define RXB1D07                          BANKMASK(RXB1D0), 7, b
#define RXB1D10                          BANKMASK(RXB1D1), 0, b
#define RXB1D11                          BANKMASK(RXB1D1), 1, b
#define RXB1D12                          BANKMASK(RXB1D1), 2, b
#define RXB1D13                          BANKMASK(RXB1D1), 3, b
#define RXB1D14                          BANKMASK(RXB1D1), 4, b
#define RXB1D15                          BANKMASK(RXB1D1), 5, b
#define RXB1D16                          BANKMASK(RXB1D1), 6, b
#define RXB1D17                          BANKMASK(RXB1D1), 7, b
#define RXB1D20                          BANKMASK(RXB1D2), 0, b
#define RXB1D21                          BANKMASK(RXB1D2), 1, b
#define RXB1D22                          BANKMASK(RXB1D2), 2, b
#define RXB1D23                          BANKMASK(RXB1D2), 3, b
#define RXB1D24                          BANKMASK(RXB1D2), 4, b
#define RXB1D25                          BANKMASK(RXB1D2), 5, b
#define RXB1D26                          BANKMASK(RXB1D2), 6, b
#define RXB1D27                          BANKMASK(RXB1D2), 7, b
#define RXB1D30                          BANKMASK(RXB1D3), 0, b
#define RXB1D31                          BANKMASK(RXB1D3), 1, b
#define RXB1D32                          BANKMASK(RXB1D3), 2, b
#define RXB1D33                          BANKMASK(RXB1D3), 3, b
#define RXB1D34                          BANKMASK(RXB1D3), 4, b
#define RXB1D35                          BANKMASK(RXB1D3), 5, b
#define RXB1D36                          BANKMASK(RXB1D3), 6, b
#define RXB1D37                          BANKMASK(RXB1D3), 7, b
#define RXB1D40                          BANKMASK(RXB1D4), 0, b
#define RXB1D41                          BANKMASK(RXB1D4), 1, b
#define RXB1D42                          BANKMASK(RXB1D4), 2, b
#define RXB1D43                          BANKMASK(RXB1D4), 3, b
#define RXB1D44                          BANKMASK(RXB1D4), 4, b
#define RXB1D45                          BANKMASK(RXB1D4), 5, b
#define RXB1D46                          BANKMASK(RXB1D4), 6, b
#define RXB1D47                          BANKMASK(RXB1D4), 7, b
#define RXB1D50                          BANKMASK(RXB1D5), 0, b
#define RXB1D51                          BANKMASK(RXB1D5), 1, b
#define RXB1D52                          BANKMASK(RXB1D5), 2, b
#define RXB1D53                          BANKMASK(RXB1D5), 3, b
#define RXB1D54                          BANKMASK(RXB1D5), 4, b
#define RXB1D55                          BANKMASK(RXB1D5), 5, b
#define RXB1D56                          BANKMASK(RXB1D5), 6, b
#define RXB1D57                          BANKMASK(RXB1D5), 7, b
#define RXB1D60                          BANKMASK(RXB1D6), 0, b
#define RXB1D61                          BANKMASK(RXB1D6), 1, b
#define RXB1D62                          BANKMASK(RXB1D6), 2, b
#define RXB1D63                          BANKMASK(RXB1D6), 3, b
#define RXB1D64                          BANKMASK(RXB1D6), 4, b
#define RXB1D65                          BANKMASK(RXB1D6), 5, b
#define RXB1D66                          BANKMASK(RXB1D6), 6, b
#define RXB1D67                          BANKMASK(RXB1D6), 7, b
#define RXB1D70                          BANKMASK(RXB1D7), 0, b
#define RXB1D71                          BANKMASK(RXB1D7), 1, b
#define RXB1D72                          BANKMASK(RXB1D7), 2, b
#define RXB1D73                          BANKMASK(RXB1D7), 3, b
#define RXB1D74                          BANKMASK(RXB1D7), 4, b
#define RXB1D75                          BANKMASK(RXB1D7), 5, b
#define RXB1D76                          BANKMASK(RXB1D7), 6, b
#define RXB1D77                          BANKMASK(RXB1D7), 7, b
#define RXB1DLC0                         BANKMASK(RXB1DLC), 0, b
#define RXB1DLC1                         BANKMASK(RXB1DLC), 1, b
#define RXB1DLC2                         BANKMASK(RXB1DLC), 2, b
#define RXB1DLC3                         BANKMASK(RXB1DLC), 3, b
#define RXB1EID0                         BANKMASK(RXB1EIDL), 0, b
#define RXB1EID1                         BANKMASK(RXB1EIDL), 1, b
#define RXB1EID10                        BANKMASK(RXB1EIDH), 2, b
#define RXB1EID11                        BANKMASK(RXB1EIDH), 3, b
#define RXB1EID12                        BANKMASK(RXB1EIDH), 4, b
#define RXB1EID13                        BANKMASK(RXB1EIDH), 5, b
#define RXB1EID14                        BANKMASK(RXB1EIDH), 6, b
#define RXB1EID15                        BANKMASK(RXB1EIDH), 7, b
#define RXB1EID16                        BANKMASK(RXB1SIDL), 0, b
#define RXB1EID17                        BANKMASK(RXB1SIDL), 1, b
#define RXB1EID2                         BANKMASK(RXB1EIDL), 2, b
#define RXB1EID3                         BANKMASK(RXB1EIDL), 3, b
#define RXB1EID4                         BANKMASK(RXB1EIDL), 4, b
#define RXB1EID5                         BANKMASK(RXB1EIDL), 5, b
#define RXB1EID6                         BANKMASK(RXB1EIDL), 6, b
#define RXB1EID7                         BANKMASK(RXB1EIDL), 7, b
#define RXB1EID8                         BANKMASK(RXB1EIDH), 0, b
#define RXB1EID9                         BANKMASK(RXB1EIDH), 1, b
#define RXB1EXID                         BANKMASK(RXB1SIDL), 3, b
#define RXB1FILHIT0                      BANKMASK(RXB1CON), 0, b
#define RXB1FILHIT1                      BANKMASK(RXB1CON), 1, b
#define RXB1FILHIT2                      BANKMASK(RXB1CON), 2, b
#define RXB1FILHIT3                      BANKMASK(RXB1CON), 3, b
#define RXB1FILHIT4                      BANKMASK(RXB1CON), 4, b
#define RXB1FUL                          BANKMASK(RXB1CON), 7, b
#define RXB1IF                           BANKMASK(PIR5), 1, a
#define RXB1IP                           BANKMASK(IPR5), 1, a
#define RXB1M0                           BANKMASK(RXB1CON), 5, b
#define RXB1M1                           BANKMASK(RXB1CON), 6, b
#define RXB1OVFL                         BANKMASK(COMSTAT), 6, a
#define RXB1RB0                          BANKMASK(RXB1DLC), 4, b
#define RXB1RB1                          BANKMASK(RXB1DLC), 5, b
#define RXB1RTR                          BANKMASK(RXB1DLC), 6, b
#define RXB1RTRR0                        BANKMASK(RXB1CON), 3, b
#define RXB1RTRRO                        BANKMASK(RXB1CON), 5, b
#define RXB1SID0                         BANKMASK(RXB1SIDL), 5, b
#define RXB1SID1                         BANKMASK(RXB1SIDL), 6, b
#define RXB1SID10                        BANKMASK(RXB1SIDH), 7, b
#define RXB1SID2                         BANKMASK(RXB1SIDL), 7, b
#define RXB1SID3                         BANKMASK(RXB1SIDH), 0, b
#define RXB1SID4                         BANKMASK(RXB1SIDH), 1, b
#define RXB1SID5                         BANKMASK(RXB1SIDH), 2, b
#define RXB1SID6                         BANKMASK(RXB1SIDH), 3, b
#define RXB1SID7                         BANKMASK(RXB1SIDH), 4, b
#define RXB1SID8                         BANKMASK(RXB1SIDH), 5, b
#define RXB1SID9                         BANKMASK(RXB1SIDH), 6, b
#define RXB1SRR                          BANKMASK(RXB1SIDL), 4, b
#define RXBNIE                           BANKMASK(PIE3), 1, a
#define RXBNIF                           BANKMASK(PIR3), 1, a
#define RXBNIP                           BANKMASK(IPR3), 1, a
#define RXBNOVFL                         BANKMASK(COMSTAT), 6, a
#define RXBP                             BANKMASK(COMSTAT), 3, a
#define RXBnIE                           BANKMASK(PIE5), 1, a
#define RXBnIF                           BANKMASK(PIR5), 1, a
#define RXBnIP                           BANKMASK(IPR5), 1, a
#define RXDTP1                           BANKMASK(BAUDCON1), 5, a
#define RXDTP2                           BANKMASK(BAUDCON2), 5, a
#define RXF0EID0                         BANKMASK(RXF0EIDL), 0, b
#define RXF0EID1                         BANKMASK(RXF0EIDL), 1, b
#define RXF0EID10                        BANKMASK(RXF0EIDH), 2, b
#define RXF0EID11                        BANKMASK(RXF0EIDH), 3, b
#define RXF0EID12                        BANKMASK(RXF0EIDH), 4, b
#define RXF0EID13                        BANKMASK(RXF0EIDH), 5, b
#define RXF0EID14                        BANKMASK(RXF0EIDH), 6, b
#define RXF0EID15                        BANKMASK(RXF0EIDH), 7, b
#define RXF0EID16                        BANKMASK(RXF0SIDL), 0, b
#define RXF0EID17                        BANKMASK(RXF0SIDL), 1, b
#define RXF0EID2                         BANKMASK(RXF0EIDL), 2, b
#define RXF0EID3                         BANKMASK(RXF0EIDL), 3, b
#define RXF0EID4                         BANKMASK(RXF0EIDL), 4, b
#define RXF0EID5                         BANKMASK(RXF0EIDL), 5, b
#define RXF0EID6                         BANKMASK(RXF0EIDL), 6, b
#define RXF0EID7                         BANKMASK(RXF0EIDL), 7, b
#define RXF0EID8                         BANKMASK(RXF0EIDH), 0, b
#define RXF0EID9                         BANKMASK(RXF0EIDH), 1, b
#define RXF0EN                           BANKMASK(RXFCON0), 0, b
#define RXF0EXIDEN                       BANKMASK(RXF0SIDL), 3, b
#define RXF0SID0                         BANKMASK(RXF0SIDL), 5, b
#define RXF0SID1                         BANKMASK(RXF0SIDL), 6, b
#define RXF0SID10                        BANKMASK(RXF0SIDH), 7, b
#define RXF0SID2                         BANKMASK(RXF0SIDL), 7, b
#define RXF0SID3                         BANKMASK(RXF0SIDH), 0, b
#define RXF0SID4                         BANKMASK(RXF0SIDH), 1, b
#define RXF0SID5                         BANKMASK(RXF0SIDH), 2, b
#define RXF0SID6                         BANKMASK(RXF0SIDH), 3, b
#define RXF0SID7                         BANKMASK(RXF0SIDH), 4, b
#define RXF0SID8                         BANKMASK(RXF0SIDH), 5, b
#define RXF0SID9                         BANKMASK(RXF0SIDH), 6, b
#define RXF10EID0                        BANKMASK(RXF10EIDL), 0, b
#define RXF10EID1                        BANKMASK(RXF10EIDL), 1, b
#define RXF10EID10                       BANKMASK(RXF10EIDH), 2, b
#define RXF10EID11                       BANKMASK(RXF10EIDH), 3, b
#define RXF10EID12                       BANKMASK(RXF10EIDH), 4, b
#define RXF10EID13                       BANKMASK(RXF10EIDH), 5, b
#define RXF10EID14                       BANKMASK(RXF10EIDH), 6, b
#define RXF10EID15                       BANKMASK(RXF10EIDH), 7, b
#define RXF10EID16                       BANKMASK(RXF10SIDL), 0, b
#define RXF10EID17                       BANKMASK(RXF10SIDL), 1, b
#define RXF10EID2                        BANKMASK(RXF10EIDL), 2, b
#define RXF10EID3                        BANKMASK(RXF10EIDL), 3, b
#define RXF10EID4                        BANKMASK(RXF10EIDL), 4, b
#define RXF10EID5                        BANKMASK(RXF10EIDL), 5, b
#define RXF10EID6                        BANKMASK(RXF10EIDL), 6, b
#define RXF10EID7                        BANKMASK(RXF10EIDL), 7, b
